v2206/Projects/airfoil_00deg/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// functions
// {
//     #includeFunc streamlines

// forceCoeffs
// {
//     type                forceCoeffs;
//     functionObjectLibs  ("libforces.so");
//     writeControl	timeStep;
//     writeInterval	100;
 
//     patches             ("airfoil");
//     rho			rhoInf;
//     log                 true;
     
//     liftDir             (0 1 0);
//     dragDir             (1 0 0);
//     CofR                (0.225 0 0);	//specify axis
//     pitchAxis           (0 0 1);	//specify axis
//     magUInf             15;
//     rhoInf              1.2;
//     lRef                1;
//     Aref                0.0001;
// }

// yPlus
// {
//     type        	yPlus;
//     writeControl	timeStep;
//     writeInterval	100;
//     libs        	("libfieldFunctionObjects.so");
// }

// }

// ************************************************************************* //
