v2206/Projects/airfoil_00deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    west
    {
        type            patch;
        nFaces          16;
        startFace       976;
    }
    east
    {
        type            patch;
        nFaces          16;
        startFace       992;
    }
    north
    {
        type            patch;
        nFaces          32;
        startFace       1008;
    }
    south
    {
        type            patch;
        nFaces          32;
        startFace       1040;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          512;
        startFace       1072;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          512;
        startFace       1584;
    }
)

// ************************************************************************* //
