v2206/Projects/airfoil_00deg/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (15 0 0);

boundaryField
{
    airfoil
    {
        type            noSlip; //movingWallVelocity; fixedValue;
        			//value           uniform (0 0 0);
    }
    west
    {
        type            fixedValue;
        value           $internalField;
    }
    east
    {
	type		zeroGradient;
	//type            inletOutlet;
        //inletValue      $internalField;
        //value           $internalField;
    }
    north
    {
        type            slip;
    }
    south
    {
        type            slip;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
